# HydraulicSeparationAmbiguity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..HydraulicSeparationAmbiguity Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
Unable to hydraulically separate until the system has flow.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HydraulicSeparationAmbiguity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HydraulicSeparationAmbiguity As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HydraulicSeparationAmbiguity {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace